<a href="https://colab.research.google.com/github/ZHAOBenyun/Learning-Numpy_Pandas/blob/main/pd_combination.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import numpy as np
import pandas as pd

In [17]:
df1 = pd.DataFrame(np.ones((3,4))*1, columns = ['a','b','c','d'])
df2 = pd.DataFrame(np.ones((3,4))*2, columns = ['a','b','c','d'])
df3 = pd.DataFrame(np.ones((3,4))*3, columns = ['a','b','c','d'])

***Concatenating***

In [18]:
print(df1)
print(df2)
print(df3)

     a    b    c    d
0  1.0  1.0  1.0  1.0
1  1.0  1.0  1.0  1.0
2  1.0  1.0  1.0  1.0
     a    b    c    d
0  2.0  2.0  2.0  2.0
1  2.0  2.0  2.0  2.0
2  2.0  2.0  2.0  2.0
     a    b    c    d
0  3.0  3.0  3.0  3.0
1  3.0  3.0  3.0  3.0
2  3.0  3.0  3.0  3.0

In [19]:
#res = pd.concat([df1, df2, df3], axis = 1)  # axis=1 horizontal 
res = pd.concat([df1, df2, df3], axis = 0)  # axis=0 vertical 
print(res)

     a    b    c    d
0  1.0  1.0  1.0  1.0
1  1.0  1.0  1.0  1.0
2  1.0  1.0  1.0  1.0
0  2.0  2.0  2.0  2.0
1  2.0  2.0  2.0  2.0
2  2.0  2.0  2.0  2.0
0  3.0  3.0  3.0  3.0
1  3.0  3.0  3.0  3.0
2  3.0  3.0  3.0  3.0

In [20]:
res = pd.concat([df1, df2, df3], axis = 0, ignore_index=True) 
print(res)

     a    b    c    d
0  1.0  1.0  1.0  1.0
1  1.0  1.0  1.0  1.0
2  1.0  1.0  1.0  1.0
3  2.0  2.0  2.0  2.0
4  2.0  2.0  2.0  2.0
5  2.0  2.0  2.0  2.0
6  3.0  3.0  3.0  3.0
7  3.0  3.0  3.0  3.0
8  3.0  3.0  3.0  3.0

In [31]:
df4 = pd.DataFrame(np.ones((3,4))*1, columns = ['a','b','c','d'], index=[1,2,3])
df5 = pd.DataFrame(np.ones((3,4))*2, columns = ['b','c','d','e'], index=[2,3,4])
print(df4)
print(df5)

     a    b    c    d
1  1.0  1.0  1.0  1.0
2  1.0  1.0  1.0  1.0
3  1.0  1.0  1.0  1.0
     b    c    d    e
2  2.0  2.0  2.0  2.0
3  2.0  2.0  2.0  2.0
4  2.0  2.0  2.0  2.0

In [33]:
res = pd.concat([df4, df5], join=('inner'), ignore_index=True)  # only keep the same part
#res = pd.concat([df4, df5], join=('outer'))
print(res)

     b    c    d
0  1.0  1.0  1.0
1  1.0  1.0  1.0
2  1.0  1.0  1.0
3  2.0  2.0  2.0
4  2.0  2.0  2.0
5  2.0  2.0  2.0

***Append***

In [35]:
res = df1.append(df2, ignore_index=True)
res

     a    b    c    d
0  1.0  1.0  1.0  1.0
1  1.0  1.0  1.0  1.0
2  1.0  1.0  1.0  1.0
3  2.0  2.0  2.0  2.0
4  2.0  2.0  2.0  2.0
5  2.0  2.0  2.0  2.0

In [37]:
res = df1.append([df2, df3], ignore_index=True)
res

     a    b    c    d
0  1.0  1.0  1.0  1.0
1  1.0  1.0  1.0  1.0
2  1.0  1.0  1.0  1.0
3  2.0  2.0  2.0  2.0
4  2.0  2.0  2.0  2.0
5  2.0  2.0  2.0  2.0
6  3.0  3.0  3.0  3.0
7  3.0  3.0  3.0  3.0
8  3.0  3.0  3.0  3.0

In [38]:
s1 = pd.Series([1,2,3,4], index = ['a','b','c','d'])

In [40]:
res = df1.append(s1, ignore_index=True)
res

     a    b    c    d
0  1.0  1.0  1.0  1.0
1  1.0  1.0  1.0  1.0
2  1.0  1.0  1.0  1.0
3  1.0  2.0  3.0  4.0

***Merge***

In [41]:
left = pd.DataFrame({'key':['K0','K1','K2','K3'],
          'A':['A0','A1','A2','A3'],
          'B':['B0','B1','B2','B3']})
right = pd.DataFrame({'key':['K0','K1','K2','K3'],
          'C':['C0','C1','C2','C3'],
          'D':['D0','D1','D2','D3']})
print(left)
print(right)

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3
  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [43]:
res = pd.merge(left,right, on ='key')
print(res)

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [50]:
left1 = pd.DataFrame({'key1':['K0','K1','K2','K3'],
          'key2':['K0','K0','K1','K2'],
          'A':['A0','A1','A2','A3'],
          'B':['B0','B1','B2','B3']})
right1 = pd.DataFrame({'key1':['K0','K1','K2','K3'],
          'key2':['K0','K1','K1','K2'],
          'C':['C0','C1','C2','C3'],
          'D':['D0','D1','D2','D3']})
print(left1)
print(right1)

  key1 key2   A   B
0   K0   K0  A0  B0
1   K1   K0  A1  B1
2   K2   K1  A2  B2
3   K3   K2  A3  B3
  key1 key2   C   D
0   K0   K0  C0  D0
1   K1   K1  C1  D1
2   K2   K1  C2  D2
3   K3   K2  C3  D3

In [51]:
res1 = pd.merge(left1,right1, on=['key1','key2'], how='inner')  # inner: keep the same parts in key1 and key2
res1

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K2   K1  A2  B2  C2  D2
2   K3   K2  A3  B3  C3  D3

In [52]:
res2 = pd.merge(left1,right1, on=['key1','key2'], how='outer')  # outer: keep all parts, and using none
res2

  key1 key2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K1   K0   A1   B1  NaN  NaN
2   K2   K1   A2   B2   C2   D2
3   K3   K2   A3   B3   C3   D3
4   K1   K1  NaN  NaN   C1   D1

In [53]:
res3 = pd.merge(left1,right1, on=['key1','key2'], how='right')  # right: keep all parts of key1 and key2 of the latter one(right1)
res3

  key1 key2    A    B   C   D
0   K0   K0   A0   B0  C0  D0
1   K1   K1  NaN  NaN  C1  D1
2   K2   K1   A2   B2  C2  D2
3   K3   K2   A3   B3  C3  D3

In [55]:
res4 = pd.merge(left1,right1, on=['key1','key2'], how='left')  # left: keep all parts of key1 and key2 of the former one(left1)
res4

  key1 key2   A   B    C    D
0   K0   K0  A0  B0   C0   D0
1   K1   K0  A1  B1  NaN  NaN
2   K2   K1  A2  B2   C2   D2
3   K3   K2  A3  B3   C3   D3

In [56]:
df4 = pd.DataFrame({'col1':[0,1], 'col_left':['a','b']})
df5 = pd.DataFrame({'col1':[1,2,2], 'col_right':[2,2,2]})
print(df4)
print(df5)

   col1 col_left
0     0        a
1     1        b
   col1  col_right
0     1          2
1     2          2
2     2          2

In [59]:
res = pd.merge(df4, df5, on='col1', how='outer', indicator=True)  # show the method of merge
# res = pd.merge(df4, df5, on='col1', how='outer', indicator='indicator_column')  # change the name of indicator
print(res)

   col1 col_left  col_right      _merge
0     0        a        NaN   left_only
1     1        b        2.0        both
2     2      NaN        2.0  right_only
3     2      NaN        2.0  right_only

In [65]:
left2 = pd.DataFrame({'A':['A0','A1','A2'],
            'B':['B0','B1','B2'],
            'index':['K0','K1','K2']})
right2 = pd.DataFrame({'C':['C0','C2','C3'],
            'D':['D0','D2','D2'],
            'index':['K0','K2','K3']})
print(left2)
print(right2)

    A   B index
0  A0  B0    K0
1  A1  B1    K1
2  A2  B2    K2
    C   D index
0  C0  D0    K0
1  C2  D2    K2
2  C3  D2    K3

In [68]:
res = pd.merge(left2,right2,how='outer')
# res = pd.merge(left2,right2,how='inner')
print(res)

     A    B index    C    D
0   A0   B0    K0   C0   D0
1   A1   B1    K1  NaN  NaN
2   A2   B2    K2   C2   D2
3  NaN  NaN    K3   C3   D2

In [83]:
boys = pd.DataFrame({'k':['K0','K1','K2'], 'age':[1,2,3]})
girls = pd.DataFrame({'k':['K0','K0','K3'], 'age':[4,5,6]})
print(boys)
print(girls)

    k  age
0  K0    1
1  K1    2
2  K2    3
    k  age
0  K0    4
1  K0    5
2  K3    6

In [84]:
res = pd.merge(boys, girls, on='k', suffixes=['_boys', '_girls'], how='outer')  # on: acoording to this keyword
res

    k  age_boys  age_girls
0  K0       1.0        4.0
1  K0       1.0        5.0
2  K1       2.0        NaN
3  K2       3.0        NaN
4  K3       NaN        6.0

In [85]:
res = pd.merge(boys, girls, on='k', suffixes=['_boys', '_girls'], how='inner')  # on: acoording to this keyword
res

    k  age_boys  age_girls
0  K0         1          4
1  K0         1          5